# +++++++++++++++++++++++++++  Задание 1 +++++++++++++++++++++++++++++++++++++++++++++
# 9. Проверить, является ли дробь A / B правильной.

# ch = int(input("введите числитель: "))
# zn = int(input("введите знаменатель: "))
# if (ch <= zn) and (ch > 0) and (zn > 0): print("дробь правильная")
# else:  print("дробь неправильная")



# 8. Дано натуральное четырехзначное число n. Верно ли, что все его цифры различны?

# a = int(input("Введите четырехзначное число: "))
# mySet = {a // 1000}
# mySet.add((a % 1000) // 100)
# mySet.add((a % 100) // 10)
# mySet.add((a % 10))
# if len(mySet) < 4: print(" Наше четырехзначное число: ", a, " , состоит из цифр: " ,
# mySet, " в нем есть повторяющиеся элементы, количество уникальных цифр = ", len(mySet))
#




